package All_Tasks_up_to_24;

public class _10_TwoDimensionalArray {
    public static void main(String[] args) {

    }
    // TODO:
    //    4. Ну и для особо отличившихся. Написать метод, который
    //    генерирует двумерный массив длиной N и высотой H
    //    Далее заполняет получившийся массив числами от 1 до W по спирали.
    //    Например массив [ ][ ][ ][ ]
    //            [ ][ ][ ][ ]
    //            [ ][ ][ ][ ]
    //    имеет N == 4 and H == 3 и вид [ 1 ][ 2 ][ 3 ][ 4 ]
    //            [10][11][12 ][ 5 ]
    //            [9 ][8 ][ 7 ][ 6 ]
}
